#include<stdio.h>




////求100-200之间的素数
//int main()
//{
//	int num = 0;
//	int i = 0;
//	for (num = 100;num<=200;num++)		//先产生100-200的数
//	{
//		//判断num是否为素数
//		//判断规则（只能被1或自身整除的数为素数）
//		//1.试除法
//		for(i = 2;i<num;i++)		//产生2到num之间的数与num取余
//		{
//			if(num%i == 0)		//如果能整除，则不是素数
//			{
//				break;		
//			}
//		}
//		if(i == num)		//如果两数相等则肯定是素数
//		{
//			printf("%d\n",num);		//只有不能被整除或直到与自身相等还未被整除的数才会被打印
//		}
//	}
//
//	return 0;
//}




////打印1000-2000年间的闰年
//int main()
//{
//	int i = 0;
//	int sum = 0;		//有多少闰年
//	for(i = 1000;i<=2000;i++)
//	{
//		//判断闰年的方法
//		//1.能被4整除且不能被100整除
//		//2.能被400整除
//		int m,n,z = 0;
//		m = i%100;
//		n = i%4;
//		z = i%400;
//		if(n == 0 && m != 0 || z == 0)
//		{
//			printf("%d ",i);
//			sum++;
//		}
//	}
//	printf("sum = %d\n",sum);
//	return 0;
//}



////给定两个数，求其最大公约数
////辗转相除法
//int main()
//{
//	int a,b = 0;
//	int r = 0;
//	scanf("%d%d",&a,&b);
//	while(a%b)
//	{
//		r = a%b;
//		a = b;
//		b = r;
//	}
//	printf("%d\n",b);
//
//	return 0;
//}


////打印1-100之间3的倍数的数字
//int main()
//{
//	int n = 0;
//	int i = 0;
//	for(n = 0;n<=100;n++)
//	{
//		i = n%3;
//		if(i == 0)
//		{
//			printf("%d\n",n);
//		}
//	}
//
//	return 0;
//}



////写代码把三个数从大到小输出
//int main()
//{
//	int a,b,c = 0;
//	scanf("%d %d %d",&a,&b,&c);		//输入三个数字
//	if(a<b)		//如果a<b
//	{
//		int tmp = a;		//先将较小值a的值存放到临时变量tmp中
//		a = b;		//再把较大值b赋给a
//		b = tmp;		//最后将临时变量tmp中的较小值赋给b
//	}
//	//以下同理
//	if(a<c)
//	{
//		int tmp = a;
//		a = c;
//		c = tmp;
//	}
//	if(b<c)
//	{
//		int tmp = b;
//		b = c;
//		c = tmp;
//	}
//	printf("%d %d %d\n",a,b,c);		//无论数字大小顺序输入如何，输出时始终a最大，c最小
//
//	return 0;
//}



////死循环的打印5
//int main()
//{
//	int i = 0;
//	for (i = 0;i<10;i++)
//	{
//		if(i=5)		//赋值
//			printf("%d",i);
//	}
//
//	return 0;
//}